# ViewSolarstudyLightingAzimuthText Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyLightingAzimuthText Property
ParameterTypeId Class See Also
---
"Lighting azimuth text"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyLightingAzimuthText { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyLightingAzimuthText As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyLightingAzimuthText {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace